[MZCurseRoundsUnlockTech X2TechTemplate]
DisplayName="Experimental Ammo: Bloodcursed Rounds"
Summary="The Bloodcurse on these rounds is immediately transferred to any enemy they strike."

[MZCurseGrenadeUnlockTech X2TechTemplate]
DisplayName="Experimental Grenade: Bloodcursed Grenade"
Summary="A terrible curse in a small package. Deals armour-piercing psi damage and inflicts Bloodcurse in a small area."

[SKV_SoundNade X2GrenadeTemplate]
FriendlyName="Sonic Grenade"
FriendlyNamePlural="Sonic Grenades"
BriefSummary="The Sonic Grenade features three pitches of skull shattering sound. Use it to disrupt pointless meetings and wake up teenagers. Low Damage but Armour is no issue and leaves the opponent Ruptured and Disoriented"
TacticalText="The Sonic Grenade features three pitches of skull shattering sound. Use it to disrupt pointless meetings and wake up teenagers. Low Damage but Armour is no issue and leaves the opponent Ruptured and Disoriented"

[SKV_ChimeraNadeM1 X2GrenadeTemplate]
FriendlyName="Basic Toxin Grenade"
FriendlyNamePlural="Basic Toxin Grenades"
BriefSummary="This grenade incorporates small hollow chambers filled with a type of organic chemical. Further analysis is required to determine this chemicals structure and properties and perhaps find a way to make it even more lethal. High poison damage, but will not poison anyone."
TacticalText="This grenade incorporates small hollow chambers filled with a type of organic chemical. Further analysis is required to determine this chemicals structure and properties and perhaps find a way to make it even more lethal. High poison damage, but will not poison anyone."

[SKV_ChimeraNadeM2 X2GrenadeTemplate]
FriendlyName="Advanced Toxin Grenade"
FriendlyNamePlural="Advanced Toxin Grenades"
BriefSummary="This grenade incorporates small hollow chambers filled with a type of organic chemical. Further analysis is required to determine this chemicals structure and properties and perhaps find a way to make it even more lethal. High poison damage, but will not poison anyone."
TacticalText="This grenade incorporates small hollow chambers filled with a type of organic chemical. Further analysis is required to determine this chemicals structure and properties and perhaps find a way to make it even more lethal. High poison damage, but will not poison anyone."

[SKV_ChimeraNadeM3 X2GrenadeTemplate]
FriendlyName="Superior Toxin Grenade"
FriendlyNamePlural="Superior Toxin Grenades"
BriefSummary="This grenade incorporates small hollow chambers filled with a type of organic chemical. Further analysis is required to determine this chemicals structure and properties and perhaps find a way to make it even more lethal. High poison damage, but will not poison anyone."
TacticalText="This grenade incorporates small hollow chambers filled with a type of organic chemical. Further analysis is required to determine this chemicals structure and properties and perhaps find a way to make it even more lethal. High poison damage, but will not poison anyone."

[SKV_ImhulluNade X2GrenadeTemplate]
FriendlyName="Dark Energy Grenade"
FriendlyNamePlural="Dark Energy Grenades"
BriefSummary="Concentrated psionic forces bursts out of this grenade overwhelming the mind of many beings, shattering and disorienting them"
TacticalText="Concentrated psionic forces bursts out of this grenade overwhelming the mind of many beings, shattering and disorienting them"

[SKV_KydoNade X2GrenadeTemplate]
FriendlyName="Matergy Grenade"
FriendlyNamePlural="Matergy Grenades"
BriefSummary="Radiation grenades release high doses of radiation upon impact, targets within the blast radius can be irradiated, set ablaze with unnatural flames, or even have the blood within their bodies boil."
TacticalText="<Bullet/> Radiation grenades will damage all units in the blast radius, and can apply a variety of radiation effects to any units vulnerable to radiation."

[SKV_ShredNade X2GrenadeTemplate]
FriendlyName="Wave Grenade"
FriendlyNamePlural="Wave Grenades"
BriefSummary="We managed to secure a blueprint of these specialized grenades from one of the munitions depots left over from the original XCOM project. These grenades are highly effective at stripping off enemy armor and making them more vulnerable to follow-up damage."
TacticalText="We managed to secure a blueprint of these specialized grenades from one of the munitions depots left over from the original XCOM project. These grenades are highly effective at stripping off enemy armor and making them more vulnerable to follow-up damage."

[SKV_StunNade X2GrenadeTemplate]
FriendlyName="Stun Gas Grenade"
FriendlyNamePlural="Stun Gas Grenades"
BriefSummary="We've carried out some tests on one of the alien stun grenades. Actually we used it on an Advent physician and after he woke up, we threatened to repeat the process unless he explained the nature of the gas to us. Yes Commander, it was cruel, but I'm sure it was less so than what happens to any humans they capture. With a little more study of the information he's provided us with we should be able to improve our understanding of alien stun gasses and perhaps improve our own stun technologies."
TacticalText="We've carried out some tests on one of the alien stun grenades. Actually we used it on an Advent physician and after he woke up, we threatened to repeat the process unless he explained the nature of the gas to us. Yes Commander, it was cruel, but I'm sure it was less so than what happens to any humans they capture. With a little more study of the information he's provided us with we should be able to improve our understanding of alien stun gasses and perhaps improve our own stun technologies."

[SKV_HotNadeM1 X2GrenadeTemplate]
FriendlyName="Basic Purification Grenade"
FriendlyNamePlural="Basic Purification Grenades"
BriefSummary="With our increased knowledge of incendiary devices we believe we can create one small enough to be thrown at your enemies. We'll shape it like a grenade so as to not overly confuse your troops and i'm pretty sure they know what to do with grenades. The shell will be filled with a volatile napalm-like mixture which will likely cause small fires and severe burns on anything it touches upon exploding. High fire damage, but will not start burning"
TacticalText="With our increased knowledge of incendiary devices we believe we can create one small enough to be thrown at your enemies. We'll shape it like a grenade so as to not overly confuse your troops and i'm pretty sure they know what to do with grenades. The shell will be filled with a volatile napalm-like mixture which will likely cause small fires and severe burns on anything it touches upon exploding. High fire damage, but will not start burning"

[SKV_HotNadeM2 X2GrenadeTemplate]
FriendlyName="Advanced Purification Grenade"
FriendlyNamePlural="Advanced Purification Grenades"
BriefSummary="With our increased knowledge of incendiary devices we believe we can create one small enough to be thrown at your enemies. We'll shape it like a grenade so as to not overly confuse your troops and i'm pretty sure they know what to do with grenades. The shell will be filled with a volatile napalm-like mixture which will likely cause small fires and severe burns on anything it touches upon exploding. High fire damage, but will not start burning"
TacticalText="With our increased knowledge of incendiary devices we believe we can create one small enough to be thrown at your enemies. We'll shape it like a grenade so as to not overly confuse your troops and i'm pretty sure they know what to do with grenades. The shell will be filled with a volatile napalm-like mixture which will likely cause small fires and severe burns on anything it touches upon exploding. High fire damage, but will not start burning"

[SKV_HotNadeM3 X2GrenadeTemplate]
FriendlyName="Superior Purification Grenade"
FriendlyNamePlural="Superior Purification Grenades"
BriefSummary="With our increased knowledge of incendiary devices we believe we can create one small enough to be thrown at your enemies. We'll shape it like a grenade so as to not overly confuse your troops and i'm pretty sure they know what to do with grenades. The shell will be filled with a volatile napalm-like mixture which will likely cause small fires and severe burns on anything it touches upon exploding. High fire damage, but will not start burning"
TacticalText="With our increased knowledge of incendiary devices we believe we can create one small enough to be thrown at your enemies. We'll shape it like a grenade so as to not overly confuse your troops and i'm pretty sure they know what to do with grenades. The shell will be filled with a volatile napalm-like mixture which will likely cause small fires and severe burns on anything it touches upon exploding. High fire damage, but will not start burning"

[SKV_NeutronNadeM1 X2GrenadeTemplate]
FriendlyName="Basic Neutron Grenade"
FriendlyNamePlural="Basic Neutron Grenades"
BriefSummary="While their plasma technology appears to involve charging ions, study of their neutron weapons suggests that they instead manipulate neutrons via some form of fusion to produce the electrical beams emitted. I can't help but feel that these two weapon principles are linked but further analysis will be required to establish their commonalities. Volatile elexctrical damage"
TacticalText="While their plasma technology appears to involve charging ions, study of their neutron weapons suggests that they instead manipulate neutrons via some form of fusion to produce the electrical beams emitted. I can't help but feel that these two weapon principles are linked but further analysis will be required to establish their commonalities. Volatile elexctrical damage"

[SKV_NeutronNadeM2 X2GrenadeTemplate]
FriendlyName="Advanced Neutron Grenade"
FriendlyNamePlural="Advanced Neutron Grenades"
BriefSummary="While their plasma technology appears to involve charging ions, study of their neutron weapons suggests that they instead manipulate neutrons via some form of fusion to produce the electrical beams emitted. I can't help but feel that these two weapon principles are linked but further analysis will be required to establish their commonalities. Volatile elexctrical damage"
TacticalText="While their plasma technology appears to involve charging ions, study of their neutron weapons suggests that they instead manipulate neutrons via some form of fusion to produce the electrical beams emitted. I can't help but feel that these two weapon principles are linked but further analysis will be required to establish their commonalities. Volatile elexctrical damage"

[SKV_NeutronNadeM3 X2GrenadeTemplate]
FriendlyName="Superior Neutron Grenade"
FriendlyNamePlural="Superior Neutron Grenades"
BriefSummary="While their plasma technology appears to involve charging ions, study of their neutron weapons suggests that they instead manipulate neutrons via some form of fusion to produce the electrical beams emitted. I can't help but feel that these two weapon principles are linked but further analysis will be required to establish their commonalities. Volatile elexctrical damage"
TacticalText="While their plasma technology appears to involve charging ions, study of their neutron weapons suggests that they instead manipulate neutrons via some form of fusion to produce the electrical beams emitted. I can't help but feel that these two weapon principles are linked but further analysis will be required to establish their commonalities. Volatile elexctrical damage"

[SKV_YggNade X2GrenadeTemplate]
FriendlyName="Yggdrasil Grenade"
FriendlyNamePlural="Yggdrasil Grenades"
BriefSummary="The power of the Tree of Life will tear down buildings ... and fast"
TacticalText="The power of the Tree of Life will tear down buildings ... and fast"